<div class="box">
    <div class="title-icon d-flex align-items-center mb-3 align-items-center">

        <svg width="34" height="34" viewBox="0 0 34 34" fill="none" xmlns="http://www.w3.org/2000/svg">
            <g id="sign-turn-left 1" clip-path="url(#clip0_241_3935)">
                <path id="Vector" d="M23.375 18.0626C23.375 16.6536 22.8153 15.3023 21.819 14.3061C20.8227 13.3098 19.4714 12.7501 18.0625 12.7501H14.875V9.63481C14.8749 9.53387 14.8461 9.43502 14.792 9.34985C14.7378 9.26468 14.6604 9.19671 14.569 9.1539C14.4776 9.11109 14.3759 9.09521 14.2758 9.10812C14.1757 9.12104 14.0813 9.16221 14.0037 9.22681L8.98873 13.4046C8.92894 13.4544 8.88084 13.5168 8.84783 13.5873C8.81482 13.6578 8.79771 13.7347 8.79771 13.8126C8.79771 13.8904 8.81482 13.9673 8.84783 14.0378C8.88084 14.1083 8.92894 14.1707 8.98873 14.2206L14.0037 18.3983C14.0813 18.4629 14.1757 18.5041 14.2758 18.517C14.3759 18.5299 14.4776 18.514 14.569 18.4712C14.6604 18.4284 14.7378 18.3604 14.792 18.2753C14.8461 18.1901 14.8749 18.0913 14.875 17.9903V14.8751H18.0625C18.9079 14.8751 19.7186 15.2109 20.3164 15.8087C20.9142 16.4064 21.25 17.2172 21.25 18.0626V23.3751H23.375V18.0626Z" fill="var(--i8-light-primary )" />
                <path id="Vector_2" fill-rule="evenodd" clip-rule="evenodd" d="M14.769 0.924375C16.0015 -0.308125 17.999 -0.308125 19.2315 0.924375L33.0759 14.7709C34.3084 16.0034 34.3084 17.9987 33.0759 19.2291L19.2315 33.0756C17.999 34.3081 16.0036 34.3081 14.7733 33.0756L0.924635 19.2313C0.631519 18.9387 0.398973 18.5913 0.240307 18.2088C0.0816402 17.8263 -3.05176e-05 17.4162 -3.05176e-05 17.0021C-3.05176e-05 16.588 0.0816402 16.178 0.240307 15.7955C0.398973 15.413 0.631519 15.0655 0.924635 14.773L14.769 0.924375ZM17.744 2.41188C17.5467 2.21463 17.2792 2.10383 17.0003 2.10383C16.7213 2.10383 16.4538 2.21463 16.2565 2.41188L2.41001 16.2563C2.21277 16.4535 2.10196 16.721 2.10196 17C2.10196 17.279 2.21277 17.5465 2.41001 17.7438L16.2565 31.5903C16.4538 31.7875 16.7213 31.8983 17.0003 31.8983C17.2792 31.8983 17.5467 31.7875 17.744 31.5903L31.5905 17.7438C31.7878 17.5465 31.8986 17.279 31.8986 17C31.8986 16.721 31.7878 16.4535 31.5905 16.2563L17.744 2.40975V2.41188Z" fill="var(--i8-light-primary )" />
            </g>
            <defs>
                <clipPath id="clip0_241_3935">
                    <rect width="34" height="34" fill="white" />
                </clipPath>
            </defs>
        </svg>
        <p class="text-blue f24 fw-7 m-0 me-2">مطالب مرتبط</p>

    </div>
<?php
// دریافت برچسب‌های مرتبط با پست فعلی
$post_tags = wp_get_post_tags(get_the_ID(), array('fields' => 'ids'));

// دریافت دسته‌بندی‌های مرتبط با پست فعلی
$post_categories = wp_get_post_categories(get_the_ID(), array('fields' => 'ids'));

// ساخت آرایه از آرگومان‌های برای بازیابی خبرهای مرتبط
$args = array(
    'post__not_in' => array(get_the_ID()), // عدم دریافت خود پست فعلی
    'posts_per_page' => 6,
    'orderby' => 'date',
    'order' => 'DESC',
    'tax_query' => array(
        'relation' => 'OR',
        array(
            'taxonomy' => 'post_tag',
            'field' => 'id',
            'terms' => $post_tags,
        ),
        array(
            'taxonomy' => 'category',
            'field' => 'id',
            'terms' => $post_categories,
        ),
    ),
);

// اجرای پرس و جو برای بازیابی خبرهای مرتبط
$related_posts = new WP_Query($args);

// نمایش خبرهای مرتبط
if ($related_posts->have_posts()) {
    echo '<div class="row d-flex flex-wrap">';
    while ($related_posts->have_posts()) {
        $related_posts->the_post();
?>
        <div class="mini-article d-flex col-md-12 col-sm-24 mb-3">
            <a href="<?php the_permalink(); ?>"><?php echo i8_the_thumbnail('hover i8-sm-85-67', 'ms-2'); ?></a>
            <a  class="text-grey " href="<?php echo the_permalink(); ?>" class="f15 me-2 l22-05"><?php echo get_the_title(); ?></a>
        </div>
<?php
    }
    echo '</div>';
}

// بازنشانی پست فعلی
wp_reset_postdata();
?>


   
</div>